#!/usr/bin/env python
# coding: utf-8

# In[ ]:


'''
2.	Написати програму з використанням рекурсії. Програма повинна приймати з консолі ціле натуральне число. Далі, 
використовуючи функцію, в якій реалізований механізм рекурсії, програма віднімае від заданого числа одиницю і виводити у 
консоль поточне число. Програма повинна припинити po6ory, коли число дорівнюватиме нулю.

'''
guess = abs(int(input("Введіть ціле натуральне число ")))     

def recursion(n):
    
    print(n)
    if n == 0:
        print("stop") 
    else:
        return recursion(n - 1)

recursion(guess)

