#!/usr/bin/env python
# coding: utf-8

# In[ ]:


'''
1.	написати програму «Вгадай число». Комп'ютер генеруе число від 1 до 100 і надае користувачеві 6 спроб, щоб він міг 
вгадати число. Коли користувач вводить число у консолі, комп'ютер перевіряе, чи відповідае воно заданому. Якщо число не 
вірне, то користувач отримуе повідомлення про те, менше чи більше число від заданого. Якщо користувач вгадав число, то 
йому повідомляеться про перемоry і про кількість використаних ним спроб. У разі вичерпання всіх спроб, корисryвач отримуе 
повідомлення про програш. Перед написанням програми, опишіть'іі алгоритм використовуючи псевдокод. Після реалізації коду, 
залиште псевдокод, як коментарі до нього.
'''
# Генеруємо та виводимо число 
import random
num = random.randint(1,100)
print(num)

# Створуємо словник для спроб
guesses = [0]

while True:
    
    # Створюємо змінну для введення чисел
    guess = int(input("Я загадав число від 1 до 100.\n Яка Ваша відгадка? "))
    
    # Тут ми тестуємо коректність відгадки
    if 101 <= guess:
        print('ПОЗА ДІАПАЗОНОМ! Спробуйте ще: ')
        continue
    if 0 >= guess:
        print('ПОЗА ДІАПАЗОНОМ! Спробуйте ще: ')
        continue 
    
    # Тут ми порівнюємо відгадку гравця із загаданим числом
    if guess == num:
        print(f'ВИТРАЮ, ВИ ВДАГАЛИ, ЦЕ ЗАНЯЛО {len(guesses)} СПРОБ!!!!')
        break
    
    # Якщо відгадка неправильна, то додаємо іі до списку
    guesses.append(guess)
   
    # Перевірки відгадки 
    if guesses != num:
        if abs(num - guess) >= 50:
            print('ДУЖЕ ХОЛОДНО! -40 ГРАДУСІВ')
        if 49 >= abs(num - guess) >= 26:
            print('ХОЛОДНО! -20 ГРАДУСІВ')
        if 25 >= abs(num - guess) >= 13:
            print('ПРОХОЛОДНО! -4 ГРАДУСІВ')
        if 12 >= abs(num - guess) >= 6:
            print('ТЕПЛІШАЄ! +12 ГРАДУСІВ')
        if 5 >= abs(num - guess) >= 3:
            print('ТЕПЛО! +22 ГРАДУСІВ')
        if 2 >= abs(num - guess) >= 1:
            print('ДУЖЕ ТЕПЛО! +28 ГРАДУСІВ')
        
    # Запускаємо сценарій програшу 
    if len(guesses) == 7:
              print("YOU LOOSE!!!")
              break

